Config/Documents/ПередачаГруппОбъектовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаГруппОбъектовОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажиВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписанияСБухУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПередачиОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМОПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПередачаГруппОбъектовОС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидОперации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", "Передача групп объектов ОС (Акт приема-передачи ОС-1б)");
	
	ЭтоПередачаВПользование = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВПользование(РеквизитыДокумента.ВидОперации);
	ЭтоПередачаВАренду = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВАренду(РеквизитыДокумента.ВидОперации);
	Запрос.УстановитьПараметр("ЭтоПередачаВПользование", ЭтоПередачаВПользование);
	Запрос.УстановитьПараметр("ЭтоПередачаВАренду",      ЭтоПередачаВАренду);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.Ссылка.ДатаСписанияСБухУчета КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Ссылка.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	"""" КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.ПередачаГруппОбъектовОС.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.ЦМОПолучатель
	|		ИНАЧЕ ТаблицаОсновныеСредства.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.ПодразделениеПолучатель
	|		ИНАЧЕ ТаблицаОсновныеСредства.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|	КОНЕЦ КАК Состояние,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|	КОНЕЦ КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВАренду = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.СдачаВАренду)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование)
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.Дата,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	&ЭтоПередачаВПользование = ИСТИНА";
	
	НомераТаблиц.Вставить("ОсновныеСредстваВПользовании", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВАренду = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.СдачаВАренду)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование)
	|	КОНЕЦ КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	&ЭтоПередачаВПользование = ИСТИНА";
					
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.										
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(РеквизитыДокумента.ВидОперации);
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаГруппОбъектовОС";
	КомандаПечати.Идентификатор		= "ОС1б";
	КомандаПечати.Представление		= НСтр("ru = 'Акт приема-передачи групп объектов ОС (ОС-1б)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаГруппОбъектовОС";
	КомандаПечати.Идентификатор		= "ПечатьТТН_1208";
	КомандаПечати.Представление		= Нстр("ru='Товарно-транспортная накладная (ф. № 1-Т)'");
	КомандаПечати.Обработчик		= "УправлениеПечатьюБГУКлиент.ПечатьТТН";
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент, ТабличныйДокумент2, ТабличныйДокумент3, ТабличныйДокумент4;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС1б") Тогда
		
		ДанныеДокументов = УправлениеОсновнымиСредствами.ДокументыДляПечатиАктОС1_Передача(МассивОбъектов, Ложь, Ложь, Истина);
		УправлениеОсновнымиСредствами.НапечататьОС1(ДанныеДокументов, ОбъектыПечати, ТабличныйДокумент); 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1б","ОС-1б", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеДляТТН(Ссылка, ОбщийИтог = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Запрос.Текст  = "ВЫБРАТЬ
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Грузоотправитель,
	|	Шапка.Контрагент КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Шапка.Договор.СчетКонтрагента, ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)) 
	|					= ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)
	|			ТОГДА Шапка.РасчетныйСчетКонтрагента
	|		ИНАЧЕ Шапка.Договор.СчетКонтрагента
	|	КОНЕЦ КАК РасчетныйСчетГрузополучателя,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Перевозчик,
	|	Шапка.Организация КАК Организация
	|ИЗ
	|	Документ.ПередачаГруппОбъектовОС КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.ОсновноеСредство КАК Номенклатура,
	|	Таблица.ОсновноеСредство.Код КАК ТоварКод,
	|	Таблица.ИнвентарныйНомер КАК ТоварАртикул,
	|	Таблица.ОсновноеСредство.Наименование КАК ТоварНаименование,
	|	""шт"" КАК БазоваяЕдиницаНаименование,
	|	СУММА(Таблица.Количество) КАК Количество,
	|	СУММА(Таблица.Количество) КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА НЕ Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.Количество = 0
	|						ТОГДА 0
	|					ИНАЧЕ Таблица.Всего / Таблица.Количество
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.ЦенаПродажи
	|	КОНЕЦ КАК Цена,
	|	СУММА(Таблица.Всего) КАК СуммаСНДС,
	|	"""" КАК НомерПрейскуранта,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК Масса,
	|	"""" КАК НомерЗаписиВКартотеке
	|ИЗ
	|	Документ.ПередачаГруппОбъектовОС.ОсновныеСредства КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.ОсновноеСредство,
	|	Таблица.ОсновноеСредство.Код,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ОсновноеСредство.Наименование,
	|	ВЫБОР
	|		КОГДА НЕ Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.Количество = 0
	|						ТОГДА 0
	|					ИНАЧЕ Таблица.Всего / Таблица.Количество
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.ЦенаПродажи
	|	КОНЕЦ";
	
	Если ОбщийИтог  Тогда
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	ОБЩИЕ";
	КонецЕсли;
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#КонецОбласти

#КонецЕсли
